wrk_results_2026-03-24_16-41-35.log
=== WRK MEASUREMENT LOG ===


=== threads=4, connections=300 ===
COMMAND: wrk -c300 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34s   294.24ms   1.45s    89.74%
    Req/Sec    53.54     19.46   171.00     85.53%
  2085 requests in 10.05s, 598.62KB read
Requests/sec:    207.52
Transfer/sec:     59.58KB


STDERR:


----------------------------------------

=== threads=4, connections=350 ===
COMMAND: wrk -c350 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 350 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.67s    44.30ms   2.00s    94.16%
    Req/Sec    63.27     34.41   222.00     82.51%
  1778 requests in 10.02s, 510.48KB read
  Socket errors: connect 0, read 8285, write 0, timeout 238
Requests/sec:    177.42
Transfer/sec:     50.94KB


STDERR:


----------------------------------------

=== threads=4, connections=400 ===
COMMAND: wrk -c400 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.92s     6.52ms   2.00s    89.91%
    Req/Sec    53.98     20.89   131.00     70.59%
  1680 requests in 10.03s, 482.34KB read
  Socket errors: connect 0, read 38464, write 0, timeout 391
Requests/sec:    167.55
Transfer/sec:     48.10KB


STDERR:


----------------------------------------

=== threads=4, connections=450 ===
COMMAND: wrk -c450 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 450 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    50.28     15.64   101.00     77.33%
  1523 requests in 10.03s, 437.27KB read
  Socket errors: connect 0, read 67810, write 0, timeout 1523
Requests/sec:    151.87
Transfer/sec:     43.60KB


STDERR:


----------------------------------------

=== threads=4, connections=500 ===
COMMAND: wrk -c500 -d10s -t4 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    44.32     17.97    90.00     75.60%
  1155 requests in 10.03s, 331.61KB read
  Socket errors: connect 0, read 93774, write 0, timeout 1155
Requests/sec:    115.15
Transfer/sec:     33.06KB


STDERR:


----------------------------------------

=== threads=8, connections=300 ===
COMMAND: wrk -c300 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 300 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.65s     4.24ms   1.66s    66.67%
    Req/Sec    29.52     19.98    80.00     69.95%
  1190 requests in 10.03s, 341.66KB read
  Socket errors: connect 0, read 53654, write 0, timeout 296
Requests/sec:    118.70
Transfer/sec:     34.08KB


STDERR:


----------------------------------------

=== threads=8, connections=350 ===
COMMAND: wrk -c350 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 350 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.91s    29.40ms   1.99s    95.89%
    Req/Sec    53.35     38.36   191.00     66.39%
  1499 requests in 10.10s, 430.38KB read
  Socket errors: connect 0, read 3584, write 0, timeout 283
Requests/sec:    148.43
Transfer/sec:     42.62KB


STDERR:


----------------------------------------

=== threads=8, connections=400 ===
COMMAND: wrk -c400 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    38.98     22.63   100.00     66.67%
  1419 requests in 10.01s, 407.41KB read
  Socket errors: connect 0, read 29680, write 0, timeout 1419
Requests/sec:    141.73
Transfer/sec:     40.69KB


STDERR:


----------------------------------------

=== threads=8, connections=450 ===
COMMAND: wrk -c450 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 450 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    33.08     23.04   111.00     49.00%
  1278 requests in 10.02s, 366.93KB read
  Socket errors: connect 0, read 64623, write 0, timeout 1278
Requests/sec:    127.60
Transfer/sec:     36.63KB


STDERR:


----------------------------------------

=== threads=8, connections=500 ===
COMMAND: wrk -c500 -d10s -t8 http://127.0.0.1:1234

STDOUT:
Running 10s test @ http://127.0.0.1:1234
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec    28.53     21.24   121.00     67.97%
  1191 requests in 10.03s, 341.95KB read
  Socket errors: connect 0, read 84194, write 0, timeout 1191
Requests/sec:    118.73
Transfer/sec:     34.09KB


STDERR:


----------------------------------------